src/src/Catalogs/Currencies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Currencies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ExportingFromInternet</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionFull</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Markup</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MainCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InWordParametersInHomeLanguage</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InWordParametersInEnglish</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RateCalculationFormula</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SetRateMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeRateSetupMethod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberInWordsLanguage</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/Enums/ExchangeRateSetupMethod.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ExchangeRateSetupMethod</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ExportFromInternet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ManualInput</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MarkupOnExchangeRateOfOtherCurrencies</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CalculationByFormula</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Catalogs/Currencies/Forms/CurrencyPickFromClassifier/Ext/Form/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("AutoTest") Then // Return if the form for analysis is received.
		Return;
	EndIf;
	
	// Filling currency list from IUC.
	CloseOnChoice = False;
	FillCurrenciesTable();
	
EndProcedure

#EndRegion

#Region FormTableItemEventHandlersCurrencyList

&AtClient
Procedure CurrencyListSelection(Item, SelectedRow, Field, StandardProcessing)
	
	ProcessChoiceInCurrencyList(StandardProcessing);
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

&AtClient
Procedure ChooseRun()
	
	ProcessChoiceInCurrencyList();
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtServer
Procedure FillCurrenciesTable()
	
	ClassifierTable = WorkWithExchangeRates.GetCurrencyClassifierTable();
	
	For Each Row In ClassifierTable Do
		NewRow = Currencies.Add();
		NewRow.DigitalCurrencyCode				= Row.Code;
		NewRow.AlphabeticCurrencyCode			= Row.CodeSymbol;
		NewRow.Description						= Row.Name;
		NewRow.CountriesAndTerritories			= Row.Description;
		NewRow.Importing						= False;
		NewRow.InWordParametersInHomeLanguage	= Row.NumerationItemOptions;
	EndDo;
	
EndProcedure

&AtServer
Function SaveSelectedRows(Val SelectedRows, IsRates)
	
	IsRates = False;
	CurrentRef = Undefined;
	
	For Each LineNumber In SelectedRows Do
		CurrentData = Currencies[LineNumber];
		
		RowInBase = Catalogs.Currencies.FindByCode(CurrentData.DigitalCurrencyCode);
		If ValueIsFilled(RowInBase) Then
			If LineNumber = Items.CurrenciesList.CurrentRow Or CurrentRef = Undefined Then
				CurrentRef = RowInBase;
			EndIf;
			Continue;
		EndIf;
		
		NewRow = Catalogs.Currencies.CreateItem();
		NewRow.Code                       = CurrentData.DigitalCurrencyCode;
		NewRow.Description              = CurrentData.AlphabeticCurrencyCode;
		NewRow.DescriptionFull        = CurrentData.Description;
		If CurrentData.Importing Then
			NewRow.SetRateMethod = Enums.ExchangeRateSetupMethod.ExportFromInternet;
		Else
			NewRow.SetRateMethod = Enums.ExchangeRateSetupMethod.ManualInput;
		EndIf;
		NewRow.InWordParametersInHomeLanguage = CurrentData.InWordParametersInHomeLanguage;
		NewRow.Write();
		
		If LineNumber = Items.CurrenciesList.CurrentRow Or CurrentRef = Undefined Then
			CurrentRef = NewRow.Ref;
		EndIf;
		
		If CurrentData.Importing Then 
			IsRates = True;
		EndIf;
		
	EndDo;
	
	Return CurrentRef;

EndFunction

&AtClient
Procedure ProcessChoiceInCurrencyList(StandardProcessing = Undefined)
	Var IsRates;
	
	// Add catalog item and display result to user.
	StandardProcessing = False;
	
	CurrentRef = SaveSelectedRows(Items.CurrenciesList.SelectedRows, IsRates);
	
	NotifyChoice(CurrentRef);
	
	ShowUserNotification(
		NStr("en = 'Currencies are added.'"), ,
		?(StandardSubsystemsClientReUse.ClientWorkParameters().DataSeparationEnabled AND IsRates, 
			NStr("en = 'Rates will be automatically imported after some time.'"), ""),
		PictureLib.Information32);
	Close();
	
EndProcedure

#EndRegion
